# BuiltInFailures.TrussFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..TrussFailures Class
BuiltInFailures Class Members See Also
---
Failures about Truss.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class TrussFailures
```

Visual Basic
---
```text
Public NotInheritable Class TrussFailures
```

Visual C++
---
```text
public ref class TrussFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..TrussFailures
# See Also
BuiltInFailures..::..TrussFailures Members
Autodesk.Revit.DB Namespace